#+TITLE: Emacs Configuration
#+AUTHOR: Colin McLear

This is my emacs configuration file. I use org-mode to organize it and then
"tangle" the file using org-babel. You can find a helpful discussion of this
method [[http://stackoverflow.com/questions/17416738/emacs-initialization-as-org-file-how-can-i-get-the-right-version-of-org-mode][here]]. 

I use emacs for all my academic work. The configuration tends in that direction,
as opposed to programming or literary work. If you don't tend to want to think
about your text editor, but like emacs, I strongly recommend [[http://spacemacs.org][spacemacs]] as a way
of managing your configuration. For a more traditional emacs feel there are also
the configurations of [[https://github.com/purcell/emacs.d][purcell]] and [[https://github.com/bbatsov/prelude][batsov (prelude)]]. For a minimally sane setup
you might also look at [[https://github.com/hrs/sensible-defaults.el][sensible defaults]].

*** Diminish minor modes
#+BEGIN_SRC emacs-lisp
  (diminish 'visual-line-mode)
  (eval-after-load "flyspell" '(diminish 'flyspell-mode "Ⓢ")) 
  (eval-after-load "org-indent" '(diminish 'org-indent-mode))
  (eval-after-load "simple" '(diminish 'auto-fill-function "Ⓕ")) 
  (eval-after-load "pandoc-mode" '(diminish 'pandoc-mode "Ⓟ"))
  (eval-after-load "git-gutter+" '(diminish 'git-gutter+-mode))
  (eval-after-load "company" '(diminish 'company-mode "Ⓒ"))
  (eval-after-load "cm-mode" '(diminish 'cm-mode "ⓒ"))
  (eval-after-load "reftex" '(diminish 'reftex-mode "ⓡ"))
  ;; (eval-after-load "autorevert" '(diminish 'auto-revert-mode))
  (eval-after-load "simple" '(diminish 'auto-revert-mode "Ⓡ"))
  (eval-after-load "aggressive-indent" '(diminish 'aggressive-indent-mode "Ⓘ"))
  (eval-after-load "auto-indent-mode" '(diminish 'auto-indent-mode "ⓘ"))
  (eval-after-load "smartparens" '(diminish 'smartparens-mode "ⓟ"))
  ;; (eval-after-load "undo-tree" '(diminish 'undo-tree-mode "Ⓤ"))
  (eval-after-load "undo-tree" '(diminish 'undo-tree-mode ""))
  (eval-after-load "projectile" '(diminish 'projectile-mode ""))
  #+END_SRC

#+RESULTS:
|   |

